import './Title.styles.scss';

import Logo from '@images/partners/logo_white.png';

const Title = () => (
    <div className="titleContainer">
        <div className="titleSmall">Партнери</div>
        <div className="titleBig">Партнери</div>
        <div className="content">
            <img className="logo" src={Logo} alt="лого" />
            Соціальні місіонери, які прагнуть кращої України. Незламні україноцентристи,
            які разом з проєктом будують круті ком’юніті патріотів та знавців української історії.
            Профі та експерти, які діляться власною експертизою з нами тут і зараз. В IT, юриспруденції,
            видавничій справі, менеджменті. Донатори та спонсори, завдяки внескам яких проєкт пульсує,
            а історія вже промовляє в міських просторах. Всі ці щирі та добрі люди, круті та ефективні
            компанії – наші партнери і справжні друзі, які розділяють наші цінності.
        </div>
        <div className="subTitle">Ми вдячні кожному. Ми поруч з кожним. Бо стріткодимо разом!</div>
    </div>
);

export default Title;
