const SectionSecond = () => (
    <section>
        <div className="title">2. Політика конфіденційності</div>
        <div className="content">
            Згідно з Законом України від 01 червня 2010 року № 2297—VI «Про захист персональних даних»
            (далі — «Закон») під персональними даними розуміють відомості чи сукупність відомостей про
            фізичну особу, яка ідентифікована або може бути конкретно ідентифікована. Згідно з
            Політикою конфіденційності в поняття «особистої інформації» входить інформація, або
            частина інформації, котра дозволяє Вас ідентифікувати. Як правило сюди входить ім&apos;я
            та прізвище, псевдонім (нік), адреса електронної пошти та/чи номер телефону, може також
            входити така інформація, як IP—адреса. Такі відомості ми можемо отримати безпосередньо
            від Вас, наприклад, при реєстрації на платформі, наданні контактних даних, інформації,
            отриманої із банківської картки, внесків або платежів, а також іншої особистої
            інформації, яку Ви добровільно надали нам.
            Відвідувачу може бути запропоновано ввести персональні дані для цілей реєстрації на платформі.
            Після заповнення будь—якої форми, розміщеної на платформі, вважається, що відвідувач надав згоду
            на обробку Організацією своїх персональних та контактних даних. Громадська організація
            «Історична платформа» може зберігати інформацію про з&apos;єднання, трафік, дату та час тривалості
            роботи відвідувача на платформі. Персональні дані відвідувачів використовуються задля
            забезпечення обміну інформацією, відносин у сфері реклами та комунікації відповідно до Законів
            України «Про захист персональних даних», «Про інформацію», «Про рекламу», «Про телекомунікації»,
             «Про підприємництво»,
            «Про захист інформації в інформаційно—телекомунікаційних системах», НД ТЗІ 2.5—010—03
             «Вимоги до захисту інформації
             WEB— сторінки від несанкціонованого доступу».
            Персональні дані зберігаються на термін не більше, ніж це необхідно відповідно до мети їх
            обробки. Після того, як суб&apos;єкт персональних даних перестав бути користувачем платформи шляхом
            видалення свого облікового запису, його персональні дані також автоматично видаляються.
            <br />
            На платформі фіксується доменне ім&apos;я або IP—адреса комп&apos;ютера відвідувача, дата доступу, файли
            (ім&apos;я файлу і URL), код відповіді HTTP та веб—сайт, з якого відвідувач потрапив на платформу,
            кількість байт, переданих в ході сесії.
            При роботі платформи використовуються файли cookie, які забезпечують підтримку функцій безпеки
            та їх запуск. Файли cookie також дозволяють відстежувати порушення політики конфіденційності та
            умови використання платформи відвідувачами/їх пристроями.
            <br />
            За допомогою системи Google Analytics збирається статистика про відвідування платформи, така як
            сторінки, що відвідуються, кількість переглядів сторінок, інформація, яка була завантажена, домени
            інтернет—провайдерів та країни походження відвідувачів. Жодна з цих дій не пов’язана з відвідувачем
            особисто та вимірюється тільки у сукупності.
        </div>
    </section>
);

export default SectionSecond;
