const SectionFirst = () => (
    <section>
        <div className="title">1. Загальні положення</div>
        <div className="content">
            Управління платформою
            &nbsp;
            <a className="link" href="https://www.streetcode.com.ua">https://www.streetcode.com.ua</a>
            &nbsp;
            (далі – платформа)
            здійснюється Громадською організацією «Історична платформа» (ЄДРПОУ 44801186) – юридичною особою,
            яка зареєстрована і діє відповідно до вимог законодавства України (далі – «Організація»).
            <br />
            Ми з винятковою повагою ставимося до конфіденційної (персональної) інформації
            відвідувачів платформи, а також тих, хто користується наданими платформою сервісами.
            Ми прагнемо захищати конфіденційність персональних даних, тим самим створивши
            і забезпечивши максимально комфортні умови використання сервісів платформи кожному користувачеві.
            У цій Політиці конфіденційності та захисту персональних даних (далі – «Політика») встановлено
            порядок здійснення Організацією обробки персональних даних, види персональних даних,
            які збираються, цілі використання таких персональних даних, взаємодія Організації з
            третіми особами, заходи безпеки для захисту персональних даних, умови доступу до
            персональних даних, а також, контактна інформація для користувача щодо отримання
            доступу, внесення змін, блокування або видалення своїх персональних даних та звернення
            з будь—якими питаннями, які можуть виникнути у Вас щодо практики захисту персональних
            даних.
        </div>
    </section>
);

export default SectionFirst;
