const SectionSixth = () => (
    <section>
        <div className="title">6. Захист персональних даних</div>
        <div className="content">
            Ми вживаємо всіх необхідних заходів для захисту даних від несанкціонованого доступу, зміни,
            розкриття чи знищення. До цих заходів належать, зокрема, внутрішня перевірка процесів збору,
            зберігання та обробки даних і заходів безпеки, включаючи відповідне шифрування і заходи щодо
            забезпечення фізичної безпеки даних для запобігання неавторизованого доступу до систем, в
            яких ми зберігаємо особисті дані.
            <br />
            Організація використовує загальноприйняті стандарти технологічного та операційного захисту
            інформації та персональних даних від втрати, неправильного використання, несанкціонованого або
            незаконного розголошення або обробки такої інформації та даних, їхньої випадкової втрати, зміни,
            знищення або пошкодження. Однак, не дивлячись на всі зусилля, Організація не може гарантувати
            абсолютну захищеність від будь—яких загроз, що виникають поза межами регулювання Організації.
            Поширення персональних даних без згоди суб&apos;єкта персональних даних або уповноваженої ним особи
            дозволяється у випадках, визначених законом, і лише (якщо це необхідно) в інтересах національної
            безпеки, економічного добробуту та прав людини.
            Користувач має право на одержання будь—яких відомостей про себе у будь—якого суб&apos;єкта відносин,
            пов&apos;язаних з персональними даними, за умови зазначення прізвища, ім&apos;я та по батькові, місця
            проживання (місця перебування) і реквізитів документа, що посвідчує фізичну особу, яка подає запит,
            крім випадків, установлених законом. Доступ користувача до даних про себе здійснюється безоплатно.
        </div>
    </section>
);

export default SectionSixth;
