const SectionThird = () => (
    <section>
        <div className="title">3. Використання та мета збору персональних даних</div>
        <div className="content">
            Особиста інформація відвідувачів платформи, зібрана при реєстрації, переважно
            використовується для надання послуг платформи відповідно до Ваших потреб, а також
            для відповідей на Ваші запитання. Також ми можемо використовувати Вашу контактну
            інформацію в поштових відправленнях, а саме повідомляти Вас про нові можливості,
            акції та інші новини. Ми діємо згідно з цією Політикою конфіденційності, на підставі
            Положення про обробку і захист персональних даних та на підставі чинного законодавства
            України.
            <br />
            Ми маємо право зберігати Персональні дані стільки, скільки необхідно для реалізації мети,
            що зазначена у даній Політиці або у строки, встановлені чинним законодавством України або до
            моменту видалення Вами цих даних. Відомості про трафік, який проходить через мережу,
            електронною поштою, і активність відвідувача в мережі Інтернет на платформі захищені
            відповідно до законодавства.
            <br />
            Ми маємо право надати будь—яку особисту інформацію відвідувачів платформи на вимогу
            правоохоронних органів, за ухвалою/рішенням суду чи в рамках інших законних процедур,
            або ж на іншу правомірну вимогу згідно з чинним законодавством України.
            Ми не несемо відповідальності за упущену вигоду, неотриманий прибуток, втрату даних,
            або будь—які інші збитки відвідувачів платформи, якщо такі виникли при користуванні платформою.
            Відвідувач платформи використовує платформу на його власний ризик. У межах, які максимально
            дозволяє закон, ані Громадська організація «Історична платформа», ані будь—яка інша сторона,
            яка залучена до створення, виробництва або обслуговування платформи, не несе відповідальності
            за пряме, непряме або випадкове пошкодження, які будь—коли завдавалися та які були спричинені
            тим, що відвідувач мав доступ до платформи або користувався нею. Ми не гарантуємо та не
            стверджуємо, що використання матеріалу, який надається на платформі, не зашкодить інтересам третіх осіб.
            <br />
            Усі права на зміст платформи належать Громадській організації «Історична платформа» або
            використовуються за згодою із правовласниками. Дана платформа в цілому, і окремі її елементи
            охороняються Законом України «Про авторське право і суміжні права», іншими актами чинного
            законодавства України та міжнародними договорами.
            Організація обмежується збором мінімального обсягу інформації, необхідного виключно для
            виконання запиту суб&apos;єкта персональних даних. У будь—якому випадку, коли запитується
            необов&apos;язкова до надання інформація, користувача буде повідомлено в момент збору такої інформації.
            <br />
            Організація не збирає будь—яку інформацію, до обробки якої законодавством встановлені
            певні вимоги, як—то інформацію про расове або етнічне походження, політичні, релігійні
            або світоглядні переконання, членство в політичних партіях та професійних спілках,
            засудження до кримінального покарання в скоєнні злочину або засудження до кримінального
            покарання, а також даних, що стосуються здоров&apos;я, статевого життя, біометричних або
            генетичних даних (відповідно до статті 7 Закону України «Про захист персональних даних»).
            <br />
            Відвідувачі платформи не повинні поширювати, змінювати, передавати, користуватися або
            використовувати повторно будь—яку інформацію з платформи для будь—якої публічної або
            комерційної мети без письмового дозволу Громадської організації «Історична платформа».
            Відвідувачі повинні дотримуватися всіх авторських прав та інших приміток про власність
            на завантажені та/або копійовані матеріали. Скопійована інформація повинна містити активне
            гіперпосилання на платформу. Копіювання інформації з платформи може бути здійснено у
            некомерційних цілях для розміщення на сторінках відвідувача, у блогах, соціальних мережах.
            <br />
            При роботі з платформою відвідувачу не надаються права на інтелектуальну власність ні на
            саму платформу, ні на її зміст чи на використання будь—яких елементів брендингу або логотипів
            платформи чи проєктів Організації.
        </div>
    </section>
);

export default SectionThird;
