const SectionFifth = () => (
    <section id="fifth" data-block-id="fifth">
        <div className="title">5. Використання файлів Cookie</div>
        <div className="content">
            Cookie – це текстовий файл або файли, що містять невеликий обсяг інформації, які
            надсилаються веб—браузеру і зберігаються на пристрої користувача. До таких пристроїв можна
            віднести комп&apos;ютер, мобільний телефон або інший пристрій, за допомогою якого
            користувач відвідує платформу.
            <br />
            Файли cookie можуть бути вічними (вони називаються постійними файлами cookie) і зберігатися в
            комп&apos;ютері, поки користувач їх не видалить, або тимчасовими (такі файли cookie називаються
            сесійними), тобто зберігаються тільки до закриття браузера. Крім того, файли cookie поділяються
            на основні (вони встановлюються безпосередньо відвідуваним платформою) і сторонні (встановлюються
            іншими веб—сайтами).
            <br />
            Важливо:
            <ul>
                <li>
                    при повторному відвідуванні користувачем платформи дані файлів cookie оновлюються;
                </li>
                <li>
                    у більшості випадків, веб—браузер за замовчуванням допускає автоматичне зберігання файлів cookie
                    на пристрої користувача;
                </li>
                <li>
                    відключення файлів cookie може призвести до обмеження доступу до опублікованих матеріалів та/або
                    неповноцінного функціонування сервісів платформи.
                </li>
            </ul>
                Організація дбає про своїх користувачів і намагається зробити перебування на платформі максимально
                комфортним. Для цього Організації необхідно за допомогою файлів cookie проаналізувати поведінку,
                переваги та інтереси користувача. Такий аналіз допоможе Організації поліпшити досвід взаємодії,
                визначити найбільш зручний інтерфейс і навігацію наших сервісів.
                Відповідно до класифікації Міжнародної торгової палати (International Chamber of Commerce),
                Організація використовує такі категорії файлів cookie на платформі:
            <ul>
                <li>
                    Строго необхідні файли cookie – потрібні для пересування користувачем по веб—сторінці і при
                    використанні певних сервісів, наприклад, для доступу до захищених сторінок, реєстрації та
                    авторизації, здійснення пошуку на платформі. Також вони здійснюють запам&apos;ятовування попередніх
                    дій користувача при переході на попередню сторінку в тій же сесії.
                </li>
                <li>
                    Експлуатаційні файли cookie – агрегують інформацію про те, як використовується платформа. Ці
                    дані зберігаються на пристрої користувача між сеансами веб—браузера. Прикладами таких даних
                    можуть бути наступні метрики: час перебування на платформі, найбільш часто відвідувані сторінки,
                    розуміння, які саме розділи і сервіси платформи були найбільш цікаві для користувача, наскільки
                    ефективна та чи інша рекламна та/або маркетингова кампанія і т.д. Вся інформація, зібрана за
                    допомогою експлуатаційних файлів cookie, призначена для статистичних та аналітичних задач. Деякі
                    дані файлів cookie можуть надаватися третім сторонам, які мають дозвіл з боку веб—ресурсу і
                    виключно для зазначених вище цілей.
                </li>
                <li>
                    Функціональні файли cookie – використовуються для збереження параметрів або конфігурацій, які
                    зберігаються на пристрої користувача між сеансами веб—браузера. Прикладами таких даних можуть
                    бути наступні метрики: ім&apos;я користувача, фото в профілі, інформація по залишених коментарях,
                    мовна версія платформи, місцезнаходження, відомості про те, чи надавалася користувачеві будь—яка
                    інформація або обрані переваги раніше, а також інші параметри налаштування платформи. Дані
                    файли cookie також дозволяють користувачам дивитися відео, брати участь в інтерактивах
                    (опитування, голосування) та взаємодіяти з соціальними мережами. Щоб зробити більш приємними
                    враження після відвідування ресурсу, зазначені файли cookie запам&apos;ятовують надану користувачем
                    інформацію, підвищуючи ефективність взаємодії з платформою. Деякі дані файлів cookie можуть
                    надаватися третім сторонам, які мають дозвіл з боку веб—ресурсу і
                    виключно для зазначених вище цілей.
                </li>
                <li>
                    Цільові файли cookie – використовуються для надання контенту, який може зацікавити користувача.
                    Ці дані зберігаються на пристрої користувача між сеансами веб—браузера. Прикладами таких даних
                    можуть бути наступні метрики: відстеження рекомендованого текстового, графічного, аудіо та
                    відеоматеріалу, щоб уникнути повторного показу, управління цільовою рекламою, оцінка ефективності
                    рекламних кампаній, інформація про відвідування користувачем інших ресурсів при переходах, а також
                    інші параметри налаштування платформи. Платформа може ділитися цією інформацією з іншими сторонами,
                    включаючи медіа—клієнтів, рекламодавців, агентства і партнерів по суміжних бізнесах для того, щоб
                    вони надавали якісну таргетовану рекламу.
                </li>
                <li>
                    Cookie—файли сторонніх сервісів і сервісів аналітики. Для оперативної доставки, більш якісного
                    відображення і детального аналізу контенту на платформі, Організація користується послугами, які
                    є власністю інших сторонніх компаній, таких як Facebook, Twitter, Instagram тощо. Наведені як
                    приклад компанії можуть використовувати файли cookie на пристрої користувача під час роботи на
                    платформі. Слід звернути увагу, що платформа не може вплинути на роботу файлів cookie, які
                    використовуються цими сервісами. Всі необхідні відомості про їх використання можна дізнатися,
                    відвідавши відповідний ресурс.
                </li>
            </ul>
                Основні веб—браузери (Google Chrome, Opera, Mozilla Firefox тощо) налаштовані на автоматичний
                прийом файлів cookie. Для того щоб їх відключити, скористайтеся функцією довідки в своєму
                браузері. Довідку можна викликати через меню або за допомогою кнопки F1.
            <br />
            Важливо:
            <ul>
                <li>
                    конфігурація налаштування файлів cookie для веб—браузерів мобільних пристроїв може відрізнятися;
                </li>
                <li>
                    варто нагадати, що повноцінна робота з платформою доступна тільки при
                    використанні файлів cookie;
                </li>
                <li>
                    відключення файлів cookie може привести до обмеження доступу до змісту і неповноцінного
                    функціонування сервісів платформи.
                </li>
            </ul>
                Щоб звернутися до Організації з приводу використання файлів cookie, відправте повідомлення
                електронною поштою на адресу&nbsp;
            <a className="link" href="streetcodeua@gmail.com">streetcodeua@gmail.com</a>
                .
            <br />
                Якщо користувач не включає використання файлів cookie або навмисно видаляє всі файли cookie
                зі свого веб—браузера, то при подальшому відвідуванні платформи, користувачеві буде повторно
                пропонуватися включення і використання файлів cookie.
                Інформація про користувачів, отримана за допомогою файлів cookie, не продається і не
                поширюється у відкритому доступі, а також є власністю Організації, якій належить ресурс.
        </div>
    </section>
);

export default SectionFifth;
