import './InterestingFactsModal.styles.scss';

import { Modal } from "antd";

import { useMobx } from "@stores/root-store";
import { observer } from "mobx-react-lite";

interface Props {

}

const volumes = ["Том 1: Суспільно-політичні твори (1894–1907).",
    "Том 2: Суспільно-політичні твори (1907–1914).",
    "Том 3: Суспільно-політичні твори (1907 — березень 1917).",
    "Том 4. Книга 1: Суспільно-політичні твори (доба Української Центральної Ради, березень 1917 — квітень 1918).",
    "Том 5: Історичні студії та розвідки (1888–1896).",
    "Том 6: Історичні студії та розвідки (1895–1900).",
    "Том 7: Історичні студії та розвідки (1900–1906).",
    "Том 8: Історичні студії та розвідки (1906–1916).",
    "Том 9: Історичні студії та розвідки (1917–1923).",
    "Том 10. Книга 1: Історичні студії та розвідки (1924— 1930)/ упор. О.Юркова.",
    "Том 10. Книга 2: Історичні студії та розвідки (1930— 1934)",
    "Том 10. Книга 3: Серія \"Історичні студії та розвідки\"",
    "Том 11: Літературно-критичні праці (1883–1931), «По світу»",
    "Том 12: Поезія (1882–1903). Проза, драматичні твори, переклади (1883–1886)",
    "Том 13 : Серія \"Літературно-критичні та художні твори (1887-1924)\"",
    "Том 14: Рецензії та огляди (1888–1897).",
    "Том 14: Рецензії та огляди (1888–1897).",
    "Том 14: Рецензії та огляди (1888–1897).",
    "Том 14: Рецензії та огляди (1888–1897).",
    "Том 14: Рецензії та огляди (1888–1897).",
    "Том 14: Рецензії та огляди (1888–1897).",
    "Том 14: Рецензії та огляди (1888–1897).",
    "Том 14: Рецензії та огляди (1888–1897).",
    "Том 14: Рецензії та огляди (1888–1897).",
    "Том 14: Рецензії та огляди (1888–1897).",
    "Том 14: Рецензії та огляди (1888–1897).",
    "Том 14: Рецензії та огляди (1888–1897).",
    "Том 20: Рецензії та огляди (1888–1897).",
];

const cancelBtnSvg = <svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
    <path
        d="M17.2868 13.998L27.3105 3.99625C27.7494 3.55724 27.996 2.96181 27.996 2.34095C27.996 1.72009
        27.7494 1.12466 27.3105 0.685649C26.8715 0.246635 26.2762 0 25.6554 0C25.0346 0 24.4393 0.246635 24.0003
        0.685649L14 10.7107L3.99966 0.685649C3.56071 0.246635 2.96537 -4.62576e-09 2.3446 0C1.72383 4.62576e-09
        1.12848 0.246635 0.68953 0.685649C0.250579 1.12466 0.00397823 1.72009 0.00397822 2.34095C0.00397822 2.96181
        0.250579 3.55724 0.68953 3.99625L10.7132 13.998L0.68953 23.9998C0.471041 24.2165 0.297623 24.4744 0.179277
        24.7585C0.0609309 25.0426 0 25.3473 0 25.6551C0 25.9628 0.0609309 26.2676 0.179277 26.5517C0.297623 26.8358
        0.471041 27.0936 0.68953 27.3104C0.906234 27.5289 1.16405 27.7023 1.44812 27.8207C1.73218 27.9391 2.03687 28
        2.3446 28C2.65233 28 2.95701 27.9391 3.24108 27.8207C3.52514 27.7023 3.78296 27.5289 3.99966 27.3104L14
        17.2853L24.0003 27.3104C24.217 27.5289 24.4749 27.7023 24.7589 27.8207C25.043 27.9391 25.3477 28 25.6554 28C25.9631
        28 26.2678 27.9391 26.5519 27.8207C26.8359 27.7023 27.0938 27.5289 27.3105 27.3104C27.529 27.0936 27.7024 26.8358
        27.8207 26.5517C27.9391 26.2676 28 25.9628 28 25.6551C28 25.3473 27.9391 25.0426 27.8207 24.7585C27.7024 24.4744
        27.529 24.2165 27.3105 23.9998L17.2868 13.998Z"
        fill="#D3CDCA"
    />
</svg>

const InterestingFactsModal = (props: Props) => {
    const { interestingFactsStore: { closeModal, isOpen } } = useMobx();

    return (
        <Modal
            open={isOpen}
            onCancel={closeModal}
            centered
            width={'43%'}
            footer={null}
            maskClosable
            closeIcon={cancelBtnSvg}
        >
            <div className={"sourceImgContainer"}>
                <h1>Книги</h1>
            </div>
            <div className={"sourcesContentContainer"}>
                <h1>Перелік книг</h1>
                <div className={"volumeContainer"}>
                    {volumes.map(title => (
                        <p>{title}</p>
                    ))}
                </div>
            </div>
        </Modal>
    );
}

export default observer(InterestingFactsModal);