const SectionFourth = () => (
    <section>
        <div className="title"> 4. Надання доступу до інформації</div>
        <div className="content">
        Надання доступу до особистої інформації іншим компаніям і приватним особам можливе лише за
        таких наступних обставин:
            <ul>
                <li>
                    Наявний дозвіл Користувача. Для передачі будь—якої конфіденційної інформації потрібна явна згода
                    Користувача.
                </li>
                <li>
                У випадках, визначених чинним законодавством України, а також у випадках запобігання злочину або
                завдання шкоди управителю та власнику платформи або третім особам.
                </li>
            </ul>
            <div className="disclaimer">
                <div className="title">Умови надання інформації (Disclaimer):</div>
                Платформа може містити посилання на інші сайти. Такі посилання наведені виключно для
                інформаційних цілей та допомагають нам найбільш повно розкрити інформацію або ілюструють
                розміщений матеріал. Той факт, що ми даємо посилання на зовнішній ресурс, не означає,
                що ми повністю схвалюємо викладені там позиції або ідеї, а також не гарантуємо
                достовірності розміщеної там інформації. Ми не несемо відповідальності за політику
                конфіденційності або зміст цих сайтів. Якщо у вас є питання або сумніви з приводу цієї
                політики, Ви можете звязатися з нами за адресою електронної пошти&nbsp;
                <a className="link" href="https://www.streetcode.com.ua">https://www.streetcode.com.ua</a>
                .
            </div>
            <div className="title">Взаємодія платформи з іншими ресурсами:</div>
            При використанні користувачем сервісів платформи на сторінках можуть бути присутніми
            коди інших інтернет—ресурсів і третіх осіб, в результаті чого такі інтернет—ресурси і
            треті особи отримують Ваші дані. Отже, ці інтернет—ресурси можуть отримувати і обробляти
             інформацію, про те, що Ви відвідали ці сторінки, а також іншу інформацію, яку передає
             браузер користувача. Такими інтернет—ресурсами можуть бути:
            <ul>
                <li>
                    системи банеропоказів (наприклад, DoubleClick for Publishers, Admixer, AdRiver тощо);
                </li>
                <li>
                    соціальні плагіни мереж (наприклад, Facebook, Instagram, Twitter, TikTok, YouTube).
                </li>
            </ul>
            Використання зазначених сервісів необхідно для оперативного аналізу відвідувань
            платформи, внутрішньої і зовнішньої оцінки відвідуваності платформи, глибини переглядів,
            активності користувачів. Дані, отримані від зазначених сервісів, Організація не зберігає
             і не обробляє.
            <br />
            Відповідно, якщо користувач в силу будь—яких причин не бажає, щоб зазначені сервіси
            отримували доступ до його персональних даних, користувач може за власним бажанням вийти
             зі свого аккаунта чи профіля, очистити файли cookie (через свій браузер).
        </div>
    </section>
);

export default SectionFourth;
